A = 0
B = "Hello"

while A == 0:#while это цикл с условием и пока учловие не будет ложным цикл будет повторятся. Это обычный While с условием
    A += 1



while True:#Бесконечный While
    A += 1
    break


for i in range(1,100,5):#For это цикл с помощью которого можно пройтись по чему либо или же вывести числа с помощью range. Первая цифра это начало цикла второе точка очтоновки а третье шаг
    print(1)



for i in B:#Проход по переменной. НЕВОЗМОЖЕН ПРОХОД ПО ИНТОВОЙ ПЕРЕМЕННОЙ
    print(i)